---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EditorInteraction Constructor
EditorInteraction Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | EditorInteraction()()()() | Construct a default interaction. |
|  | EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

# See Also

EditorInteraction Class

EditorInteraction Members

Autodesk.Revit.UI Namespace